scalarTransport/facultyStudio-case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-2.59 -2.29 0)
    ( 2.59 -2.29 0)
    ( 2.59  2.29 0)
    (-2.59  2.29 0)
    (-2.59 -2.29 3.04)
    ( 2.59 -2.29 3.04)
    ( 2.59  2.29 3.04)
    (-2.59  2.29 3.04)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (42 37 25) simpleGrading (1 1 1)
    // hex (0 1 2 3 4 5 6 7) (16 12 7) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    swalls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
