scalarTransport/facultyStudio-case/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    swalls
    {
        type            calculated;
        value           uniform 0;
    }
    door
    {
        type            calculated;
        value           uniform 0;
    }
    inhale
    {
        type            calculated;
        value           uniform 0;
    }
    exhale
    {
        type            calculated;
        value           uniform 0;
    }
    mouthInhale
    {
        type            calculated;
        value           uniform 0;
    }
    mouthExhale
    {
        type            calculated;
        value           uniform 0;
    }
    "proc.*"
    {
        type            processor;
    }
}

// ************************************************************************* //
