scalarTransport/facultyStudio-case/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    swalls
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    door
    {
        type            prghTotalPressure;
        rho             rhok;
        p0              uniform 0;
    }
    inhale
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    exhale
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    mouthInhale
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    mouthExhale
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    "proc.*"
    {
        type            processor;
    }
}

// ************************************************************************* //
