scalarTransport/facultyStudio-case/0.orig/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    swalls
    {
        type            zeroGradient;
    }
    door
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    inhale
    {
        type            zeroGradient;
    }
    exhale
    {
        type            zeroGradient;
    }
    mouthInhale
    {
        type            zeroGradient;
    }
    mouthExhale
    {
        type            fixedValue;
        value           uniform 4.72e+05;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
