scalarTransport/facultyStudio-case/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.26;

boundaryField
{
    swalls
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    door
    {
        type            inletOutlet;
        inletValue      $internalField;
    }
    inhale
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    exhale
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    mouthInhale
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.0075;
        value           $internalField;
    }
    mouthExhale
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.0075;
        value           $internalField;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
