scalarTransport/facultyStudio-case/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 293
    volScalarFieldValue C 0
);

regions
(
    // boxToCell
    // {
    //     box (-0.01 -0.01 -1) (0.01 0 1);
    //     fieldValues
    //     (
    //         volScalarFieldValue C 0
    //     );
    // }
    // // Set patch values (using ==)
    // boxToFace
    // {
    //     box (-0.01 -0.01 -1) (0.01 0 1);

    //     fieldValues
    //     (
    //         volScalarFieldValue C 0    
    //     );
    // }
);


// ************************************************************************* //
